[
  { "name": "Marios Velivasakis",
    "message": "Mohabat will always be in my heart. She was such a kind and special friend. From the very first moment I met her, I realized what a wonderful person she was.\nShe has left us so many beautiful memories and she will always be remembered."
  },
  { "name": "Prajwal Udanshive",
    "message": "Mohabat and I attended Graham's course on Convex Geometry in the fall of 2020 as well as Dan's course on Mathematical Computation in the summer of 2020. I particularly remember her infectious enthusiasm and passion for polyhedral geometry, especially whenever there was combinatorics lurking in the background. Her friendly and warm personality made her standout even more.\nI hope you find some comfort and solace in this version of her in my memories: a warm, kind, lively mathematician."
  },
  { "name": "Chris Kapulkin",
    "message": "Mohabat was a spectacular student. She was warm, charismatic, energetic, and driven. She was involved both in the directed reading program and the graduate student seminar. She was recognized with a TA award. She actively participated in all kinds of seminars, even on topics far from her research interests.\nI worked with Mohabat on multiple occasions, but our research paths crossed only once. In 2022, we both participated in the Ontario Combinatorics Workshop in Waterloo: Mohabat was giving a talk and I served as one of the judges for the award for the best student talk. I can tell you that the committee reached the decision within seconds because of how good Mohabat's talk was. Many students approached her afterwards asking how to get involved in her research area. This is how inspiring she was."
  },
  { "name": "Blake Boudreaux",
    "message": "I am incredibly sorry to hear of the loss of Mohabat Tarkeshian. I am not familiar with her mathematical work, but I had the great fortune of being an instructor of Calc 1000 with her last year, as well as proctoring with her. She had an amazing personality that would light up any room she was in. I distinctly remember, after a long night of proctoring (that did not go smoothly), her smile, jokes, and bright personality livening up the room of disgruntled proctors and instructors---we all left in a better mood that night because of her.\nShe will be fondly remembered in the hearts of the mathematics department at Western."
  },
  { "name": "Oussama Hamza",
    "message": "My sincere condolences for the tragic loss of Mohabat to you and her family. She will be definitively remembered as an extremely sympathetic and helpful person."
  },
  { "name": "Matthias Franz",
    "message": "It was always a pleasure to interact with Mohabat. She spread joy all around her and was readily willing to help others or contribute to the department. I also benefited from it when she wrote a letter to support my recent promotion.\nI will keep a fond memory of Mohabat."
  },
  { "name": "Alan Flatrès",
    "message": "Mohabat was a friend of mine and we organized the grad seminar together last year. She was such a nice and joyful person and many people will remember her for that."
  },
  { "name": "Tina Mansoori",
    "message": "Mohabat and I met in high school. The moment we met, everything clicked, as if we had known each other for a lifetime instead. Her intelligence always left me in awe; she was incredibly well rounded in all her school subjects. I was so proud of Mohabat when she won York University’s Silver Medal for Academic Merit. She inspired me everyday to become a curious learner, simply just from watching her love for learning.\nNot only was Mohabat intelligent, but she was extremely kind. Her kindness could warm up the entire room. She had an infectious laugh and a glowing smile. She made a positive impression with every person she met. I remember all the times Mohabat was there for me when I needed a shoulder to cry on, or someone to laugh with. Even when our lives went in different directions after high school, we kept in touch. When we would meet again in person, it felt like we were just picking up from where we left off. I always appreciated that. No matter the adversities we both faced in our lives, we always found a way back together, like it was a destined friendship for life.\nI am so grateful to have known you Mohabat. My heart still aches knowing I can never hug you again, or laugh with you again. I will miss the times when we would watch horror movies on Netflix and eat Costco chicken wings together, laughing at the scenes seemingly trying to be scary. I will miss watching “Backstabbed” together, our video project we made in high school. Our poor acting skills in that video still makes me chuckle. I will miss our deep conversations about life and relationships, that would keep us busy for hours. I will cherish all these memories and the many more we have made together, forever in my heart. I love you Mohabat."
  },
  { "name": "Luuk Verhoeven",
    "message": "Mohabat and I did our PhDs almost exactly in sync and were fast friends almost from the get go.\nShe was a great mathematician and an even greater friend.\nWe relied on each other from the comprehensives to the writing and the defense for support and good advice.\n\nWhat I loved most about her is her genuine willingness to connect, share her passions and listen to those of others.\nI will cherish the memory of the joy she had in showing me Ted Lasso, her friendly outrage at my lack of van Gogh knowledge, and her passion for Pixar."
  },
  { "name": "Udit Mavinkurve",
    "message": "Mohabat was a close friend and confidante. She helped me through some of my lowest points in the last few years and I will always be indebted to her for that. A talented mathematician and equally generous, she somehow always found energy to help others around her. She was dedicated to making the world of mathematics a kinder, more inclusive place and I have no doubt that she would have succeeded if she had more time. I will miss her."
  },
  { "name": "Alexanda Chronopoulos",
    "message": "From our first days at Humewood Community School, Mohabat and I were fast friends. Sharing a love of reading and sense of adventure, some of my earliest and fondest memories are with dear Mohabat. She was the best of us - a brilliant mathematician, the kindest soul, and a steadfast and faithful friend. I count myself incredibly lucky to have known her and feel privileged to have had her friendship over these last decades. Despite the twists and turns of life, she remained one of my dearest and beloved friends, who always had a kind word and made it feel as though no time had passed when we re-connected. Rest in love, light, and peace, dear friend. I will cherish your memory forever."
  }
]
