[{
  "name": "Marios Velivasakis",
  "message": "Mohabat will always be in my heart. She was such a kind and special friend. From the very first moment I met her, I realized what a wonderful person she was.\n\nShe has left us so many beautiful memories and she will always be remembered."
},
{ "name": "Prajwal Udanshive",
  "message": "Mohabat and I attended Graham's course on Convex Geometry in the fall of 2020 as well as Dan's course on Mathematical Computation in the summer of 2020. I particularly remember her infectious enthusiasm and passion for polyhedral geometry, especially whenever there was combinatorics lurking in the background. Her friendly and warm personality made her standout even more.\nI hope you find some comfort and solace in this version of her in my memories: a warm, kind, lively mathematician."
},
{ "name": "Chris Kapulkin",
  "message": "Mohabat was a spectacular student. She was warm, charismatic, energetic, and driven. She was involved both in the directed reading program and the graduate student seminar. She was recognized with a TA award. She actively participated in all kinds of seminars, even on topics far from her research interests.\nI worked with Mohabat on multiple occasions, but our research paths crossed only once. In 2022, we both participated in the Ontario Combinatorics Workshop in Waterloo: Mohabat was giving a talk and I served as one of the judges for the award for the best student talk. I can tell you that the committee reached the decision within seconds because of how good Mohabat's talk was. Many students approached her afterwards asking how to get involved in her research area. This is how inspiring she was."
},
{ "name": "Blake Boudreaux",
  "message": "I am incredibly sorry to hear of the loss of Mohabat Tarkeshian. I am not familiar with her mathematical work, but I had the great fortune of being an instructor of Calc 1000 with her last year, as well as proctoring with her. She had an amazing personality that would light up any room she was in. I distinctly remember, after a long night of proctoring (that did not go smoothly), her smile, jokes, and bright personality livening up the room of disgruntled proctors and instructors---we all left in a better mood that night because of her.\nShe will be fondly remembered in the hearts of the mathematics department at Western. "
},
{ "name": "Oussama Hamza",
  "message": "My sincere condolences for the tragic loss of Mohabat to you and her family. She will be definitively remembered as an extremely sympathetic and helpful person."
}]
